# 輸入今日漲跌幅
r = float(input("請輸入台積電今日漲跌幅（%）（例如1.25或-0.80）："))

# 參數
P_0 = float(1000) # 基本股價(元/股)
N = 10 # 總股數(股)
f = 0.001425 # 手續費率(買/賣接收)
t = 0.003 # 交易稅率(僅賣出收)

# 計算
P_1 = P_0 * (1 + r / 100) # 今日股價(元/股)
Delta_P = P_1 - P_0 # 每股變動金額(元/股)
P_S = (P_0 * (1 + f))/(1 - f - t) # 損益兩平所需的賣出價(元/股)
BreakEvenPct = (P_S / P_0 - 1) * 100 # 損益兩平所需漲幅(%)

# 輸出結果
print(" \n=== 台積電股價變動換算結果 ===")
print(f"基準股價：{P_0} 元/股")
print(f"持股數量：{N} 張（ {N*1000} 股）")
print(f"今日漲跌幅：{r} %\n")

print("1) 今日股價")
print(f"   {P_0 + Delta_P} 元/股\n")

print("2) 持股市值變化")
print(f"   基準市值：{P_0 * N * P_0} 元")
print(f"   今日市值：{(P_0+Delta_P) * N * P_0} 元")
print(f"   市值變化：{Delta_P * N * P_0} 元\n")

print("3) 等效每股變動金額")
print(f"   每股變動：{Delta_P} 元/股\n")

print("4) 損益兩平漲幅（含手續費與賣出交易稅）")
print(f"   手續費率（買/賣）：{f * 100} %")
print(f"   交易稅率（賣出）：{t * 100} %")
print(f"   兩平所需賣出價：{P_S} 元/股")
print(f"   兩平所需漲幅：{BreakEvenPct} %")